-- MySQL dump 10.13  Distrib 8.0.23, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: happyhouse
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `school`
--

DROP TABLE IF EXISTS `school`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `school` (
  `school` varchar(10) NOT NULL,
  `name` varchar(40) NOT NULL,
  `dong` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `school`
--

LOCK TABLES `school` WRITE;
/*!40000 ALTER TABLE `school` DISABLE KEYS */;
INSERT INTO `school` VALUES ('초등학교','서울자곡초등학교','자곡동'),('초등학교','서울율현초등학교','자곡동'),('중학교','세곡중학교','자곡동'),('초등학교','서울세명초등학교','세곡동'),('중학교','휘문중학교','대치동'),('중학교','진선여자중학교','역삼동'),('중학교','중동중학교','일원동'),('중학교','은성중학교','도곡동'),('중학교','숙명여자중학교','도곡동'),('중학교','단국대학교사범대학부속중학교','대치동'),('중학교','청담중학교','청담동'),('중학교','역삼중학교','역삼동'),('중학교','언주중학교','삼성동'),('중학교','언북중학교','논현동'),('중학교','압구정중학교','압구정동'),('중학교','신사중학교','압구정동'),('중학교','신구중학교','신사동'),('중학교','수서중학교','수서동'),('중학교','봉은중학교','삼성동'),('중학교','도곡중학교','도곡동'),('중학교','대치중학교','도곡동'),('중학교','대청중학교','대치동'),('중학교','대왕중학교','수서동'),('중학교','대명중학교','대치동'),('중학교','구룡중학교','개포동'),('중학교','개포중학교','개포동'),('중학교','개원중학교','개포동'),('초등학교','서울학동초등학교','논현동'),('초등학교','서울포이초등학교','개포동'),('초등학교','서울청담초등학교','청담동'),('초등학교','서울일원초등학교','일원동'),('초등학교','서울왕북초등학교','수서동'),('초등학교','서울영희초등학교','일원동'),('초등학교','서울역삼초등학교','역삼동'),('초등학교','서울언주초등학교','도곡동'),('초등학교','서울언북초등학교','청담동'),('초등학교','서울양전초등학교','개포동'),('초등학교','서울압구정초등학교','압구정동'),('초등학교','서울신구초등학교','신사동'),('초등학교','서울수서초등학교','수서동'),('초등학교','서울삼릉초등학교','삼성동'),('초등학교','서울봉은초등학교','삼성동'),('초등학교','서울도성초등학교','역삼동'),('초등학교','서울도곡초등학교','대치동'),('초등학교','서울대현초등학교','대치동'),('초등학교','서울대치초등학교','대치동'),('초등학교','서울대청초등학교','일원동'),('초등학교','서울대진초등학교','개포동'),('초등학교','서울대왕초등학교','세곡동'),('초등학교','서울대모초등학교','일원동'),('초등학교','서울대도초등학교','도곡동'),('초등학교','서울대곡초등학교','대치동'),('초등학교','서울논현초등학교','논현동'),('초등학교','서울구룡초등학교','개포동'),('초등학교','서울개포초등학교','개포동'),('초등학교','서울개일초등학교','개포동'),('초등학교','서울개원초등학교','개포동'),('고등학교','단국대학교부속소프트웨어고등학교','대치동'),('고등학교','풍문고등학교','자곡동'),('고등학교','압구정고등학교','압구정동'),('외국인학교','한국외국인학교','개포동'),('고등학교','대진디자인고등학교','수서동'),('고등학교','서울로봇고등학교','일원동'),('특수학교','서울정애학교','삼성동'),('특수학교','밀알학교','일원동'),('방송통신고등학교','경기여자고등학교부설방송통신고등학교','개포동'),('고등학교','수도전기공업고등학교','개포동'),('고등학교','휘문고등학교','대치동'),('고등학교','현대고등학교','압구정동'),('고등학교','진선여자고등학교','역삼동'),('고등학교','중앙대학교사범대학부속고등학교','도곡동'),('고등학교','중산고등학교','일원동'),('고등학교','중동고등학교','일원동'),('고등학교','은광여자고등학교','도곡동'),('고등학교','영동고등학교','청담동'),('고등학교','숙명여자고등학교','도곡동'),('고등학교','서울세종고등학교','수서동'),('고등학교','단국대학교사범대학부속고등학교','대치동'),('고등학교','청담고등학교','압구정동'),('고등학교','경기여자고등학교','개포동'),('고등학교','경기고등학교','삼성동'),('고등학교','개포고등학교','개포동'),('각종학교(중)','국립국악중학교','개포동'),('고등학교','국립국악고등학교','개포동');
/*!40000 ALTER TABLE `school` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-05-27 20:11:20
